import pytest

from select_ans import select_best_answer


@pytest.mark.parametrize(
    "scores, expected",
    [
        # 単純なケース: エッジスコアで一意に決定
        ([(0.8, 0.5), (0.6, 0.7), (0.9, 0.4), (0.7, 0.6)], 2),
        # エッジスコアが同点、ノードスコアで一意に決定
        ([(0.8, 0.5), (0.8, 0.7), (0.6, 0.4), (0.7, 0.6)], 1),
        (
            [
                (0.0, 0.47535595297813416),
                (0.25, 0.47535595297813416),
                (0.0, 0.47535595297813416),
                (0.25, 0.22535595297813416),
            ],
            1,
        ),
        # ノードスコアが一意で決定
        ([(0.8, 0.5), (0.8, 0.6), (0.8, 0.4), (0.8, 0.3)], 1),
        # ノードスコアに差があるが、エッジスコアが全て0（エッジスコアが0のみならば決定しない）
        ([(0.0, 0.24065910279750824), (0.0, 0.25), (0.0, 0.20173871517181396), (0.0, 0.24065910279750824)], -1),
        # エッジスコアとノードスコアが同点でタイ（決定不可）
        ([(0.8, 0.5), (0.8, 0.5), (0.6, 0.4), (0.7, 0.6)], -1),
        # エッジスコアとノードスコアが同点でタイ。ノードスコアが全て同じ（決定不可）
        ([(0.0, 0.890430361032486), (0.0, 0.890430361032486), (1.0, 0.890430361032486), (1.0, 0.890430361032486)], -1),
        # 全てのスコアが同じ
        ([(0.5, 0.5), (0.5, 0.5), (0.5, 0.5), (0.5, 0.5)], -1),
        # スコアが1つだけ
        ([(0.9, 0.7)], 0),
    ],
)
def test_select_best_answer(scores, expected):
    assert select_best_answer(scores) == expected
